Revit 2026 API

# SectionViewFailures Properties

---

The BuiltInFailuresSectionViewFailures type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | ScopeBoxBehindSection | Section may not be associated to a scope box which lies behind it. |

#### Reference

BuiltInFailuresSectionViewFailures Class

Autodesk.Revit.DB Namespace